[
    {
        "Target Usage": "",
        "Name": "COS",
        "Short Description": "",
        "Documentation": {
            "Description": "\n<p>\n The need to integrate renewable power sources into the electricity \ngrid is a global imperative. Today, balance can only be maintained by \nrapidly altering conventional power outputs to compensate for changes in\n renewables. In addition where wind power is excessive, it may have to \nbe constrained, which is wasteful and incurs significant operator costs.\n Given existing emission commitments, both of these issues will only \nbecome more acute over the next two decades. A radical solution to this \ndilemma, and one that will also support long term renewable targets, is \nto invert the normal approach and to make relatively static demand level\n more dynamic and track the supply.\n</p>\n\n<p>\n There are a number of important aspects to this including: regional \npower balancing, balancing of renewal supply, responding to electricity \nmarket signals, and supply-demand balancing services supplied directly \nto power system operators.\n</p>\n\n<p>\n Regarding regional power balancing, the overall objective is to \nmanage EV charging processes in a region or amongst a group of \nfacilities to achieve a requested target power profile subject to \ndistribution network constraints. Such constraints must be monitored by \nthe DSO and respected by the charging optimisation system.\n</p>\n\n<p>\n The COS DSE ensures that the large-scale coordinated interruption \nand de-interruption of electric vehicle charging will not disrupt the \nlocal distribution network.\n</p>\n\n<a name=\"Basic-Concepts\">\n</a>\n\n<h3>\n Basic Concepts\n <a class=\"wiki-anchor\" href=\"#Basic-Concepts\">\n  ¶\n </a>\n</h3>\n\n<p>\n The functional model presented in this section aims to encompass the\n whole of the charging optimisation space, as well as related functions \nsuch as for example TSO/DSO power system management, renewable \ngeneration (eg. wind farms and solar power plants) management, and \nenergy market management functions.\n</p>\n\n<p>\n The trial will focus only on those parts of the charging \noptimisation function that are interesting and realistic to implement, \nare relevant for Generic Enabler application, and will yield valuable \nresult when scaled to the commercial level.\n</p>\n\n<a name=\"Basic-Design-Principles\">\n</a>\n\n<h3>\n Basic Design Principles\n <a class=\"wiki-anchor\" href=\"#Basic-Design-Principles\">\n  ¶\n </a>\n</h3>\n\n<p>\n <img alt=\"\" src=\"COS_files/wp5_cos_dse.png\" style=\"width: 75%;\"/>\n</p>\n\n<table>\n <tbody>\n  <tr>\n   <td style=\"background:lightgrey;\">\n    Sub-function\n   </td>\n   <td style=\"background:lightgrey;\">\n    Description\n   </td>\n  </tr>\n  <tr>\n   <td>\n    Grid Emergency Processing\n   </td>\n   <td>\n    This is a new component to the COS DSE. The Grid Emergency \nProcessing component listens for Grid Emergency events being transmitted\n by the Grid Emergency Initiator (DSO/TSO). Requests are first decrypted\n using the Content Based Security generic enabler, before being \nvalidated. When such a message has been validated as authentic, the Grid\n Emergency Processing component will initiate a grid emergency within \nthe charge optimisation system by requesting all EVSEs cease charging \nimmediately.\n   </td>\n  </tr>\n  <tr>\n   <td>\n    EVSE Controller\n   </td>\n   <td>\n    This component connects to an individual EVSE in order to control\n it, and also will be used retrieve the data blocks of information being\n transmitted by the EVSE.\n   </td>\n  </tr>\n  <tr>\n   <td>\n    EVSE Data Parser\n   </td>\n   <td>\n    This component retrieves raw data from the message queue on the \nmessage bus, will parse the data and pass to the Data Validator for \nvalidation and integrity check.\n   </td>\n  </tr>\n  <tr>\n   <td>\n    EVSE Data Validator\n   </td>\n   <td>\n    The contents of the parsed data block (from EVSE Data Parser) \nare validated against the checksum attached to the data block by this \ncomponent.\n   </td>\n  </tr>\n  <tr>\n   <td>\n    Data Processing and Analytics Engine\n   </td>\n   <td>\n    The charge optimisation system makes use of a distributed \ncomputation platform, Apache Storm along with the Complex Event \nProcessing generic enabler in order to process the massive and \ncontinuous stream of data entering the system from the trial EVSEs. \nThese components allow processing tasks such as aggregation and analysis\n to be performed before persisting the data within the system.\n   </td>\n  </tr>\n  <tr>\n   <td>\n    Web Application API\n   </td>\n   <td>\n    The Web Application API component is built using a RESTful \narchitecture style and offers an interface to allow partners / SMEs to \ndevelop applications and software in order to interact with or even \naugment and extend the Charge Optimisation Systems core features and \nfunctionality. It is possible to retrieve, analyse and graph charge \nprofiles for individual EVSEs, or access current and historic regional \nrenewables supply data, along with forecasted demand. e.g. The \nOptimisation Service is itself an application built using this Web \nApplication API, as is the administration dashboard application.\n   </td>\n  </tr>\n  <tr>\n   <td>\n    Conflict Resolver\n   </td>\n   <td>\n    The responsibilities of the Conflict Resolver is that of EVSE \ncommunication exception handling within the COS. e.g. When a charge \noptimisation request is issued, the conflict resolver will ensure that \nrequests will not be sent to an EVSE if it does not currently have a car\n connected.\n   </td>\n  </tr>\n  <tr>\n   <td>\n    Regional Power Optimizer\n   </td>\n   <td>\n    Optimises a schedule for a given number of controllable loads to \nfollow a given (aggregated) power profile with a given forecast \nduration.\n   </td>\n  </tr>\n  <tr>\n   <td>\n    Charging Interruption Management\n   </td>\n   <td>\n    This is a new component to the COS DSE. The charging interruption\n management component is responsible for handling the conversion of \ncharge optimisation requests into charging change authorisation requests\n for the ESB Servo system. Servo will investigate the distribution \nnetwork impact of such a change, and respond to the charging \ninterruption management component with either a go or no go response. If\n Servo denies a change, the charging interruption management system will\n inform the Optimisation System with the response from Servo. \nAlternatively if Servo responds favourably, the charging interruption \nmanagement component will enact the optimisation request by forwarding \nthe particular changes for each individual EVSE to the Conflict \nResolver.\n   </td>\n  </tr>\n  <tr>\n   <td>\n    FI-WARE Data handling GE\n   </td>\n   <td>\n    The Data handling GE is used to ensure the privacy of sensitive \ndata. In the case of the Charging Optimisation System the sensitive data\n in question relates to data belonging to the EVSE. This GE uses a \nSticky Policy which is written in Privacy Policy Language. The policy \nprovides control over a) who can access this data and b) the duration \nfor which this data can be accessed.\n   </td>\n  </tr>\n  <tr>\n   <td>\n    FI-WARE DB Anonymiser GE\n   </td>\n   <td>\n    This GE is currently being integrated with the COS DSE system to \nevaluate the adequateness (in maintaining privacy and anonymisation) of a\n disclosure policy to be used to disclose a dataset from the COS DSE to \nthird parties such as SMEs. This will ensure any shared data cannot be \nreconstructed to extract PII\n   </td>\n  </tr>\n  <tr>\n   <td>\n    FI-WARE Identity Management GCP GE\n   </td>\n   <td>\n    The Identity Management GE provides customer administration as \nwell as identity management, authentication and authorization services. \nThe GE implements security standards such as OAuth and OpenId. The GE \nhas been selected to provide authentication to clients who require to \naccess data in the COS DSE system. The Identity Management GCP GE is \nused in the Charging Optimisation System as a means for authenticating \nits Web API users. As the API provides access to data stored within the \nCOS, security is a major factor and as such it is of upmost importance \nthat persons allowed to access this data can be verified in a controlled\n and reliable manner.\n   </td>\n  </tr>\n  <tr>\n   <td>\n    FI-WARE Content Based Security GE\n   </td>\n   <td>\n    This GE is integrated locally and is being used by the developers\n of the COS DSE system in order to support the confidentiality of grid \nemergency messages between TSOs/DSOs and the COS DSE. A second instance \nof the content based security will be required to be hosted on the \nTSO/DSO side of the connection in a grid initiator application which \ngenerates the initial grid emergency messages.\n   </td>\n  </tr>\n  <tr>\n   <td>\n    FI-WARE Complex Event Processing GE\n   </td>\n   <td>\n    The CEP GE analyses event data in real-time, generates immediate \ninsight and enables instant response to changing conditions. While \nstandard reactive applications are based on reactions to single events, \nthe CEP GE reacts to situations rather than to single events. A \nsituation is a condition that is based on a series of events that have \noccurred within a dynamic time window called processing context. \nSituations include composite events (e.g., sequence), counting operators\n on events (e.g., aggregation) and absence operators.. Due to the data \nprotection requirements for the COS DSE it is considered necessary to \nintegrate a localised instance of the Complex Event Processing GE which \nwill work alongside and compliment the Apache Storm stream processor of \nthe COS DSE\n   </td>\n  </tr>\n  <tr>\n   <td>\n    FI-WARE Cloud Edge GE\n   </td>\n   <td>\n    This GE is deployed as a network bridging application in order to connect an electric vehicle charge equipment to the COS DSE.\n   </td>\n  </tr>\n </tbody>\n</table>\n\n<a name=\"Detailed-Specifications\">\n</a>\n\n",
            "Copyright": "\n<p>\n Copyright © 2014 by FINESCE\n</p>\n\n<a name=\"Preface\">\n</a>\n\n",
            "Glossary": "\n<table>\n <tbody>\n  <tr>\n   <td style=\"background:lightgrey;\">\n    Term\n   </td>\n   <td style=\"background:lightgrey;\">\n    Definition\n   </td>\n  </tr>\n  <tr>\n   <td>\n    API\n   </td>\n   <td>\n    Application Programming Interface\n   </td>\n  </tr>\n  <tr>\n   <td>\n    COS\n   </td>\n   <td>\n    Charging Optimisation System\n   </td>\n  </tr>\n  <tr>\n   <td>\n    DSE\n   </td>\n   <td>\n    Domain Specific Enabler\n   </td>\n  </tr>\n  <tr>\n   <td>\n    DSO\n   </td>\n   <td>\n    Distribution System Operator\n   </td>\n  </tr>\n  <tr>\n   <td>\n    EV\n   </td>\n   <td>\n    Electric Vehicles\n   </td>\n  </tr>\n  <tr>\n   <td>\n    EVSE\n   </td>\n   <td>\n    Electric Vehicle Supply Equipment\n   </td>\n  </tr>\n  <tr>\n   <td>\n    GE\n   </td>\n   <td>\n    Generic Enabler\n   </td>\n  </tr>\n  <tr>\n   <td>\n    TSO\n   </td>\n   <td>\n    Transmission System Operator\n   </td>\n  </tr>\n </tbody>\n</table>\n\n<a name=\"References\">\n</a>\n\n",
            "References": "\n",
            "Details": "\n<p>\n The COS API which is up and available to use, allows a user to view \nor control an EVSE or access various aggregated trial-site load \ninformation e.g. aggregated EV load, renewable energy supply, etc.\n <br/>\n This\n API would open possibilities of integration of EV control into \ndifferent end user applications (mobile/web applications) for smart home\n management, energy management, etc.\n <br/>\n The API follows the rules of a common RESTful approach:\n</p>\n\n<ol>\n <li>\n  Rely on HTTP/RESTful services (wherever possible) in order to \naddress the most broad community of application developers with the \npopular technology\n </li>\n <li>\n  Expose WP5 Stream I EV charging infrastructure and trial results\n </li>\n <li>\n  Expose the COS DSE interface allowing the system to be accessible for external applications.\n </li>\n</ol>\n\n<p>\n From a developers point of view the API it is documented in swagger and available at the API website:\n <a class=\"external\" href=\"https://finesce.tssg.org/documentation/index.html\">\n  https://finesce.tssg.org/documentation/index.html\n </a>\n</p>\n\n<a name=\"API-Control-functions\">\n</a>\n\n<h3>\n API Control functions\n <a class=\"wiki-anchor\" href=\"#API-Control-functions\">\n  ¶\n </a>\n</h3>\n\n<p>\n The base url for all requests is\n <a class=\"external\" href=\"https://finesce.tssg.org/api/v2\">\n  https://finesce.tssg.org/api/v2\n </a>\n , and any requests using http will be redirected to https, of note a self-signed cert is used for SSL.\n</p>\n\n\n\n￼￼WP5 have implemented the following HTTP commands being used to manipulate the data controlled by the FINESCE system.\n\t<ol>\n <li>\n  HTTP GET commands used to retrieve information from the database\n </li>\n <li>\n  HTTP PUT commands used to update individual record in the database\n </li>\n <li>\n  HTTP POST to add new records to the database\n </li>\n <li>\n  HTTP DELETE to remove records from the database\n </li>\n</ol>\n\n<p>\n The following endpoints are currently implemented in the external \nAPI system on collection resources. All calls require an auth_token to \nbe sent with the request (This excludes the tokens endpoint). NOTE: the \nparameter for sending the authorisation token is \"auth_token\".\n</p>\n\n<ol>\n <li>\n  Miscellaneous\n </li>\n <li>\n  Generationplants\n </li>\n <li>\n  Regionalaggevseenergies\n </li>\n <li>\n  Timeslots\n </li>\n <li>\n  Evevseconnections\n </li>\n <li>\n  Chargingmodes\n </li>\n <li>\n  Electricvehicles\n </li>\n <li>\n  Estimatedsocs\n </li>\n <li>\n  Regions\n </li>\n <li>\n  Generationtypes\n </li>\n <li>\n  Regionalenergies\n </li>\n <li>\n  Evses\n </li>\n <li>\n  Evevseconnectionstates\n </li>\n <li>\n  Evtypes\n </li>\n <li>\n  Stateofcharges\n </li>\n</ol>\n\n<a name=\"Re-utilised-TechnologiesSpecifications\">\n</a>\n\n",
            "Preface": "\n<p>\n Within this document you find a self-contained open specification of\n the FINESCE WP5 Charging Optimisation System (COS) Domain Specific \nEnabler (DSE).\n</p>\n\n<p>\n Please consult the appropriate pages on the\n <a class=\"external\" href=\"http://www.finesce.eu/Trial_Site_Ireland.html\">\n  FINESCE\n </a>\n website in order to understand the complete context of the related FINESCE trials and this DSE.\n</p>\n\n<a name=\"T38Cs\">\n</a>\n\n"
        },
        "WP": "",
        "Terms and Conditions": "\n<a name=\"Overview\">\n</a>\n\n",
        "Open Source": "",
        "Contact Person": "",
        "Overview": "\n<p>\n The WP5 Stream I team have developed an active demand dispatch \nsystem as a FINESCE domain specific enabler. This system optimises \ncharging profiles for available Electric Vehicles (EV)s on the grid, by \ntaking input of power generation forecasts from system operators‘ web \nsites and using request-response message exchange patterns with live \nEVSE's connected to the grid to create an optimised load scheduler every\n 15 minutes.\n</p>\n\n<a name=\"Target-Usage\">\n</a>\n\n",
        "Downloads": "",
        "Instances": ""
    }
]