[
    {
        "Last Update": "2015-09-04",
        "Target Usage": "\n<p>\n There are several major applications of this concept in the control of electricity grids, including:\n</p>\n\n<ol>\n <li>\n  Develop flexible and rapid responses to grid emergencies while minimising customer impact;\n </li>\n <li>\n  Balancing volatile renewable supply and EV demand, to minimise CO2 emissions;\n </li>\n <li>\n  Manipulate inter-regional power flows to avoid the high costs of future power link upgrades;\n </li>\n <li>\n  Provide energy markets with an additional control capability;\n </li>\n <li>\n  Offer individual customers and service providers more information and control of their electric vehicle charging applications.\n </li>\n</ol>\n\n\n",
        "Name": "Charging Optimisation System (COS)",
        "Short Description": "",
        "Documentation": {
            "Description": "\n<p>\n The need to integrate renewable power sources into the electricity grid is a global imperative. Today, balance can only be maintained by rapidly altering conventional power outputs to compensate for changes in renewables. In addition where wind power is excessive, it may have to be constrained, which is wasteful and incurs significant operator costs. Given existing emission commitments, both of these issues will only become more acute over the next two decades. A radical solution to this dilemma, and one that will also support long term renewable targets, is to invert the normal approach and to make relatively static demand level more dynamic and track the supply.\n</p>\n\n<p>\n There are a number of important aspects to this including: regional power balancing, balancing of renewal supply, responding to electricity market signals, and supply-demand balancing services supplied directly to power system operators.\n</p>\n\n<p>\n Regarding regional power balancing, the overall objective is to manage EV charging processes in a region or amongst a group of facilities to achieve a requested target power profile subject to distribution network constraints. Such constraints must be monitored by the DSO and respected by the charging optimisation system.\n</p>\n\n<p>\n The COS ensures that the large-scale coordinated interruption and de-interruption of electric vehicle charging will not disrupt the local distribution network.\n</p>\n\n\n<h3>\n Basic Concepts\n</h3>\n\n<p>\n The functional model presented in this section aims to encompass the whole of the charging optimisation space, as well as related functions such as for example TSO/DSO power system management, renewable generation (eg. wind farms and solar power plants) management, and energy market management functions.\n</p>\n\n<p>\n The trial will focus only on those parts of the charging optimisation function that are interesting and realistic to implement, are relevant for Generic Enabler application, and will yield valuable result when scaled to the commercial level.\n</p>\n\n\n<h3>\n Basic Design Principles\n</h3>\n\n<p>\n <img alt=\"\" src=\"images/redmine/wp5_cos_dse.png\" style=\"width: 75%;\" class=img-responsive />\n</p>\n\n<table class=\"themed\">\n <tr class=\"top\">\n  <td style=\"background:lightgrey;\">\n   Sub-function\n  </td>\n  <td style=\"background:lightgrey;\">\n   Description\n  </td>\n </tr>\n <tr>\n  <td>\n   Grid Emergency Processing\n  </td>\n  <td>\n   This is a new component to the COS. The Grid Emergency Processing component listens for Grid Emergency events being transmitted by the Grid Emergency Initiator (DSO/TSO). Requests are first decrypted using the Content Based Security generic enabler, before being validated. When such a message has been validated as authentic, the Grid Emergency Processing component will initiate a grid emergency within the charge optimisation system by requesting all EVSEs cease charging immediately.\n  </td>\n </tr>\n <tr>\n  <td>\n   EVSE Controller\n  </td>\n  <td>\n   This component connects to an individual EVSE in order to control it, and also will be used retrieve the data blocks of information being transmitted by the EVSE.\n  </td>\n </tr>\n <tr>\n  <td>\n   EVSE Data Parser\n  </td>\n  <td>\n   This component retrieves raw data from the message queue on the message bus, will parse the data and pass to the Data Validator for validation and integrity check.\n  </td>\n </tr>\n <tr>\n  <td>\n   EVSE Data Validator\n  </td>\n  <td>\n   The contents of the parsed data block (from EVSE Data Parser) are validated against the checksum attached to the data block by this component.\n  </td>\n </tr>\n <tr>\n  <td>\n   Data Processing and Analytics Engine\n  </td>\n  <td>\n   The charge optimisation system makes use of a distributed computation platform, Apache Storm along with the Complex Event Processing generic enabler in order to process the massive and continuous stream of data entering the system from the trial EVSEs. These components allow processing tasks such as aggregation and analysis to be performed before persisting the data within the system.\n  </td>\n </tr>\n <tr>\n  <td>\n   Web Application API\n  </td>\n  <td>\n   The Web Application API component is built using a RESTful architecture style and offers an interface to allow partners / SMEs to develop applications and software in order to interact with or even augment and extend the Charge Optimisation Systems core features and functionality. It is possible to retrieve, analyse and graph charge profiles for individual EVSEs, or access current and historic regional renewables supply data, along with forecasted demand. e.g. The Optimisation Service is itself an application built using this Web Application API, as is the administration dashboard application.\n  </td>\n </tr>\n <tr>\n  <td>\n   Conflict Resolver\n  </td>\n  <td>\n   The responsibilities of the Conflict Resolver is that of EVSE communication exception handling within the COS. e.g. When a charge optimisation request is issued, the conflict resolver will ensure that requests will not be sent to an EVSE if it does not currently have a car connected.\n  </td>\n </tr>\n <tr>\n  <td>\n   Regional Power Optimizer\n  </td>\n  <td>\n   Optimises a schedule for a given number of controllable loads to follow a given (aggregated) power profile with a given forecast duration.\n  </td>\n </tr>\n <tr>\n  <td>\n   Charging Interruption Management\n  </td>\n  <td>\n   This is a new component to the COS. The charging interruption management component is responsible for handling the conversion of charge optimisation requests into charging change authorisation requests for the ESB Servo system. Servo will investigate the distribution network impact of such a change, and respond to the charging interruption management component with either a go or no go response. If Servo denies a change, the charging interruption management system will inform the Optimisation System with the response from Servo. Alternatively if Servo responds favourably, the charging interruption management component will enact the optimisation request by forwarding the particular changes for each individual EVSE to the Conflict Resolver.\n  </td>\n </tr>\n <tr>\n  <td>\n   FI-WARE Data handling GE\n  </td>\n  <td>\n   The Data handling GE is used to ensure the privacy of sensitive data. In the case of the Charging Optimisation System the sensitive data in question relates to data belonging to the EVSE. This GE uses a Sticky Policy which is written in Privacy Policy Language. The policy provides control over a) who can access this data and b) the duration for which this data can be accessed.\n  </td>\n </tr>\n <tr>\n  <td>\n   FI-WARE DB Anonymiser GE\n  </td>\n  <td>\n   This GE is currently being integrated with the COS system to evaluate the adequateness (in maintaining privacy and anonymisation) of a disclosure policy to be used to disclose a dataset from the COS to third parties such as SMEs. This will ensure any shared data cannot be reconstructed to extract PII\n  </td>\n </tr>\n <tr>\n  <td>\n   FI-WARE Identity Management GCP GE\n  </td>\n  <td>\n   The Identity Management GE provides customer administration as well as identity management, authentication and authorization services. The GE implements security standards such as OAuth and OpenId. The GE has been selected to provide authentication to clients who require to access data in the COS system. The Identity Management GCP GE is used in the Charging Optimisation System as a means for authenticating its Web API users. As the API provides access to data stored within the COS, security is a major factor and as such it is of upmost importance that persons allowed to access this data can be verified in a controlled and reliable manner.\n  </td>\n </tr>\n <tr>\n  <td>\n   FI-WARE Content Based Security GE\n  </td>\n  <td>\n   This GE is integrated locally and is being used by the developers of the COS system in order to support the confidentiality of grid emergency messages between TSOs/DSOs and the COS. A second instance of the content based security will be required to be hosted on the TSO/DSO side of the connection in a grid initiator application which generates the initial grid emergency messages.\n  </td>\n </tr>\n <tr>\n  <td>\n   FI-WARE Complex Event Processing GE\n  </td>\n  <td>\n   The CEP GE analyses event data in real-time, generates immediate insight and enables instant response to changing conditions. While standard reactive applications are based on reactions to single events, the CEP GE reacts to situations rather than to single events. A situation is a condition that is based on a series of events that have occurred within a dynamic time window called processing context. Situations include composite events (e.g., sequence), counting operators on events (e.g., aggregation) and absence operators.. Due to the data protection requirements for the COS it is considered necessary to integrate a localised instance of the Complex Event Processing GE which will work alongside and compliment the Apache Storm stream processor of the COS\n  </td>\n </tr>\n <tr>\n  <td>\n   FI-WARE Cloud Edge GE\n  </td>\n  <td>\n   This GE is deployed as a network bridging application in order to connect an electric vehicle charge equipment to the COS.\n  </td>\n </tr>\n</table>\n\n\n<h3>\n DSE Interwork\n</h3>\n\n<p>\n The interwork is shown in the diagram above in the Basic Design Principles section.\n</p>\n\n<p>\n The COS can interwork with the Hybrid Cloud Data Management (HCDM) DSE, which acts as an additional storage location for the EV charge data, although of note the COS is NOT dependant on the HCDM DSE and the COS can work independently of it.\n</p>\n\n\n<h3>\n GE Dependancies\n</h3>\n\n<p>\n The COS has dependancies with the following GE's\n</p>\n\n<ul>\n <li>\n  Complex Event Processing GE (version DATA-CEP 3.3.1)\n </li>\n <li>\n  Content Based Security GE (cbs.fiware.release-3.2.1)\n </li>\n <li>\n  Data Handling GE (version 3.3)\n </li>\n <li>\n  DB Anonymiser GE (version 3.3)\n </li>\n <li>\n  Identity Management GCP GE (Is a FIWARE hosted Service End point)\n </li>\n</ul>\n\n\n",
            "Copyright": "\n<p>\n Copyright © 2015 by FINESCE\n</p>\n\n\n",
            "Glossary": "\n<table class=\"themed\">\n <tr class=\"top\">\n  <td style=\"background:lightgrey;\">\n   Term\n  </td>\n  <td style=\"background:lightgrey;\">\n   Definition\n  </td>\n </tr>\n <tr>\n  <td>\n   API\n  </td>\n  <td>\n   Application Programming Interface\n  </td>\n </tr>\n <tr>\n  <td>\n   COS\n  </td>\n  <td>\n   Charging Optimisation System\n  </td>\n </tr>\n <tr>\n  <td>\n   DSO\n  </td>\n  <td>\n   Distribution System Operator\n  </td>\n </tr>\n <tr>\n  <td>\n   EV\n  </td>\n  <td>\n   Electric Vehicles\n  </td>\n </tr>\n <tr>\n  <td>\n   EVSE\n  </td>\n  <td>\n   Electric Vehicle Supply Equipment\n  </td>\n </tr>\n <tr>\n  <td>\n   GE\n  </td>\n  <td>\n   Generic Enabler\n  </td>\n </tr>\n <tr>\n  <td>\n   TSO\n  </td>\n  <td>\n   Transmission System Operator\n  </td>\n </tr>\n</table>\n\n\n",
            "References": "\n\n",
            "Details": "\n<p>\n The COS API which is up and available to use, allows a user to view or control an EVSE or access various aggregated trial-site load information e.g. aggregated EV load, renewable energy supply, etc.\n <br/>\n This API would open possibilities of integration of EV control into different end user applications (mobile/web applications) for smart home management, energy management, etc.\n <br/>\n The API follows the rules of a common RESTful approach:\n</p>\n\n<ol>\n <li>\n  Rely on HTTP/RESTful services (wherever possible) in order to address the most broad community of application developers with the popular technology\n </li>\n <li>\n  Expose WP5 Stream I EV charging infrastructure and trial results\n </li>\n <li>\n  Expose the COS interface allowing the system to be accessible for external applications.\n </li>\n</ol>\n\n<p>\n From a developers point of view the API it is documented in swagger and available at the API website:\n <a class=\"external\" href=\"https://finesce.tssg.org/documentation/index.html\">\n  https://finesce.tssg.org/documentation/index.html\n </a>\n</p>\n\n\n<h3>\n API Control functions\n</h3>\n\n<p>\n The base url for all requests is\n <a class=\"external\" href=\"https://finesce.tssg.org/api/v2\">\n  https://finesce.tssg.org/api/v2\n </a>\n , and any requests using http will be redirected to https, of note a self-signed cert is used for SSL.\n</p>\n\n\n\nWP5 have implemented the following HTTP commands being used to manipulate the data controlled by the FINESCE system.\n\t<ol>\n <li>\n  HTTP GET commands used to retrieve information from the database\n </li>\n <li>\n  HTTP PUT commands used to update individual record in the database\n </li>\n <li>\n  HTTP POST to add new records to the database\n </li>\n <li>\n  HTTP DELETE to remove records from the database\n </li>\n</ol>\n\n<p>\n The following endpoints are currently implemented in the external API system on collection resources. All calls require an auth_token to be sent with the request (This excludes the tokens endpoint). NOTE: the parameter for sending the authorisation token is \"auth_token\".\n</p>\n\n<ol>\n <li>\n  Miscellaneous\n </li>\n <li>\n  Generationplants\n </li>\n <li>\n  Regionalaggevseenergies\n </li>\n <li>\n  Timeslots\n </li>\n <li>\n  Evevseconnections\n </li>\n <li>\n  Chargingmodes\n </li>\n <li>\n  Electricvehicles\n </li>\n <li>\n  Estimatedsocs\n </li>\n <li>\n  Regions\n </li>\n <li>\n  Generationtypes\n </li>\n <li>\n  Regionalenergies\n </li>\n <li>\n  Evses\n </li>\n <li>\n  Evevseconnectionstates\n </li>\n <li>\n  Evtypes\n </li>\n <li>\n  Stateofcharges\n </li>\n</ol>\n\n\n",
            "Preface": "\n<p>\n Within this document you find a self-contained open specification of the FINESCE WP5 Charging Optimisation System (COS).\n</p>\n\n<p>\n Please consult the appropriate pages on the\n <a class=\"external\" href=\"http://www.finesce.eu/Trial_Site_Ireland.html\">\n  FINESCE\n </a>\n website in order to understand the complete context of the related FINESCE trials.\n</p>\n\n\n",
            "ReutilisedTech": "\n<p>\n As mentioned earlier the COS re-uses the FI-WARE Data Handling GE, FI-WARE DB Anonymiser GE, FI-WARE Identity Management GCP GE , FI-WARE Content Based Security GE , FI-WARE Complex Event Processing GE and FI-WARE Cloud Edge GE.\n</p>\n\n\n"
        },
        "Version": "1.0",
        "WP": "",
        "Usage": "\n<p>\n Documentation on the API can be found at\n <a class=\"external\" href=\"https://finesce.tssg.org/documentation/index.html\">\n  index.html\n </a>\n</p>\n\n<p>\n Also in the\n <a class=\"external\" href=\"files/COS_SME_ACCESS_Usage_Examples.pdf\">\n  pdf attached\n </a>\n is a full set of usage examples.\n</p>\n\n<p>\n The COS API is built around the RESTful architectural style. All calls return application/json.\n</p>\n\n<p>\n Registration can only be performed by a member of the TSSG Finesce COS Team. As part of the registration you will receive an email. The subject on the email is Team FINESCE and the origin of the email is\n <a class=\"email\" href=\"mailto:Bernhard354@ver.sul.t-online.de\">\n  Bernhard354@ver.sul.t-online.de\n </a>\n</p>\n\n<p>\n You must click the link contained within this email within 24hrs to confirm your registration with our system.\n</p>\n\n<p>\n An authentication token is required to access all endpoints except for the tokens endpoints. Url paramter required is auth_token. Example usage: auth_token=abc123\n</p>\n\n<p>\n Some url parameters may be appended to all calls except for the tokens resource.\n</p>\n\n<p>\n These are:\n <br/>\n limit: limits the quantitiy of records returned. A value between 200 and 1000 is accepted. Default is 200. Example usage: limit=1000\n <br/>\n offset: starting point for the records returned. Default is the last record. Example usage: offset=2000\n <br/>\n order_by: allows user to sort the records by a field. Default is id. Example usage: order_by=created_at\n <br/>\n sort: allows the user to sort the records asending or descending. Values asc and desc are accepted. Default is desc. Example usage: sort=asc\n</p>\n\n\n<h3>\n Usage\n</h3>\n\n\n\nYou can either interact with the API by:\n\t<ol>\n <li>\n  using a http client library in your chosen language (python, ruby, java, etc...)\n </li>\n <li>\n  using a command line tool such a Curl\n </li>\n <li>\n  using a browser based swagger tool\n </li>\n</ol>\n\n<p>\n Each query must have an auth_token appended to the end of it.\n</p>\n\n<p>\n The browser based sand box tool is the best way to see how this works\n <br/>\n <a class=\"external\" href=\"https://finesce.tssg.org/documentation/index.html\">\n  index.html\n </a>\n</p>\n\n<p>\n In particular I want you to create a token\n <a class=\"external\" href=\"https://finesce.tssg.org/documentation/index.html#!/tokens\">\n  tokens\n </a>\n</p>\n\n<p>\n You have 2 options, but the one I'd like you to click is the \"Create an authentication token\".\n</p>\n\n<p>\n A drop down area will appear and you should see an area to add your email &amp; password, add these in and hit the button called Try it out!\n</p>\n\n<p>\n You should see the 400 characters token which by the way becomes obsolete after 8 hours.\n <br/>\n It is accompanied by a refresh_token so as to give you two choices to gain a fresh token.\n</p>\n\n<p>\n You you can try one of the API calls, let's try the \"Retrieve the electric vehicles in the system\"\n <br/>\n <a class=\"external\" href=\"https://finesce.tssg.org/documentation/index.html#!/electricvehicles/getElectricvehicles\">\n  getElectricvehicles\n </a>\n</p>\n\n<p>\n Add that 400 character access_token as a parameter, leave all the rest blank and hit \"Try it out!\"\n <br/>\n You should get back a JSON formatted list of EV's in our system\n</p>\n\n<p>\n Now you are under way and start to write your own programme to use the WP5 API\n</p>\n\n\n",
        "Terms and Conditions": "\n<p>\n Thank you for using FINESCE's APIs, other developer services, and associated software (collectively, \"APIs\"). By accessing or using the COS API, you are agreeing to the terms below. If there is a conflict between these terms and additional terms applicable to a given API, the additional terms will control for that conflict. Collectively, we refer to the terms below, any additional terms, terms within the accompanying API documentation, and any applicable policies and guidelines as the \"Terms.\" You agree to comply with the Terms and that the Terms control your relationship with us. So please read all the Terms carefully. If you use the APIs as an interface to, or in conjunction with other FINESCE services, then the terms for those other services also apply.\n</p>\n\n<p>\n Under the Terms, \"FINESCE\" means the EC FI-PPP project FINESCE (Contract No. 604677), unless set forth otherwise in additional terms applicable for a given API. We may refer to \"FINESCE\" as \"we\", \"our\", or \"us\" in the Terms.\n</p>\n\n\n<h3>\n Account and Registration\n</h3>\n\n\n<h4>\n Accepting the Terms\n</h4>\n\n<p>\n You may not use the APIs and may not accept the Terms if (a) you are not of legal age to form a binding contract with FINESCE, or (b) you are a person barred from using or receiving the APIs under the applicable laws Ireland or other countries including the country in which you are resident or from which you use the APIs.\n</p>\n\n\n<h4>\n Entity Level Acceptance\n</h4>\n\n<p>\n If you are using the APIs on behalf of an entity, you represent and warrant that you have authority to bind that entity to the Terms and by accepting the Terms, you are doing so on behalf of that entity (and all references to \"you\" in the Terms refer to that entity).\n</p>\n\n\n<h4>\n Registration\n</h4>\n\n<p>\n In order to access certain APIs you may be required to provide certain information (such as identification or contact details) as part of the registration process for the APIs, or as part of your continued use of the APIs. Any registration information you give to FINESCE will always be accurate and up to date and you'll inform us promptly of any updates.\n</p>\n\n\n<h3>\n Using Our APIs\n</h3>\n\n\n<h4>\n Your End Users\n</h4>\n\n<p>\n You will require your end users to comply with (and not knowingly enable them to violate) applicable law, regulation, and the Terms.\n</p>\n\n\n<h4>\n Compliance with Law, Third Party Rights, and Other FINESCE Terms of Service\n</h4>\n\n<p>\n You will comply with all applicable law, regulation, and third party rights (including without limitation laws regarding the import or export of data or software, privacy, and local laws). You will not use the APIs to encourage or promote illegal activity or violation of third party rights. You will not violate any other terms of service with FINESCE (or its affiliates).\n</p>\n\n\n<h4>\n Permitted Access\n</h4>\n\n<p>\n You will only access (or attempt to access) an API by the means described in the documentation of that API. If FINESCE assigns you developer credentials, you must use them with the applicable APIs. You will not misrepresent or mask either your identity or your API Client's identity when using the APIs or developer accounts.\n</p>\n\n\n<h4>\n API Limitations\n</h4>\n\n<p>\n FINESCE sets and enforces limits on your use of the APIs (e.g. limiting the number of API requests that you may make or the number of users you may serve), in our sole discretion. You agree to, and will not attempt to circumvent, such limitations documented with each API. If you would like to use any API beyond these limits, you must obtain FINESCE's express consent (and FINESCE may decline such request or condition acceptance on your agreement to additional terms and/or charges for that use). To seek such approval, contact the relevant FINESCE API team for information.\n</p>\n\n\n<h4>\n Open Source Software\n</h4>\n\n<p>\n Some of the software required by or included in our APIs may be offered under an open source license. Open source software licenses constitute separate written agreements. For certain APIs, open source software is listed in the documentation. To the limited extent the open source software license expressly supersedes the Terms, the open source license instead sets forth your agreement with FINESCE for the applicable open source software.\n</p>\n\n\n<h4>\n Feedback\n</h4>\n\n<p>\n If you provide feedback or suggestions about our APIs, then we (and those we allow) may use such information without obligation to you.\n</p>\n\n\n<h3>\n Your API Clients\n</h3>\n\n\n<h4>\n API Clients and Monitoring\n</h4>\n\n<p>\n The APIs are designed to help you enhance your websites and applications (\"API Client(s)\"). YOU AGREE THAT FINESCE MAY MONITOR USE OF THE APIS TO ENSURE QUALITY, IMPROVE FINESCE SERVICES, AND VERIFY YOUR COMPLIANCE WITH THE TERMS. This monitoring may include FINESCE accessing and using your API Client, for example to identify security issues that could affect FINESCE or its users. You will not interfere with this monitoring. FINESCE may use any technical means to overcome such interference. FINESCE may suspend access to the APIs by you or your API Client without notice if we reasonably believe that you are in violation of the Terms.\n</p>\n\n\n<h4>\n Security\n</h4>\n\n<p>\n You will use commercially reasonable efforts to protect user information collected by your API Client, including personally identifiable information (\"PII\"), from unauthorized access or use and will promptly report to your users any unauthorized access or use of such information to the extent required by applicable law.\n</p>\n\n\n<h4>\n Ownership\n</h4>\n\n<p>\n FINESCE does not acquire ownership in your API Clients, and by using our APIs, you do not acquire ownership of any rights in our APIs or the content that is accessed through our APIs.\n</p>\n\n\n<h4>\n User Privacy and API Clients\n</h4>\n\n<p>\n You will comply with all applicable privacy laws and regulations including those applying to PII. You will provide and adhere to a privacy policy for your API Client that clearly and accurately describes to users of your API Client what user information you collect and how you use and share such information with FINESCE and third parties.\n</p>\n\n\n<h3>\n Prohibitions and Confidentiality\n</h3>\n\n\n<h4>\n API Prohibitions\n</h4>\n\n<p>\n When using the APIs, you may not (or allow those acting on your behalf to):\n</p>\n\n<ul>\n <li>\n  Sublicense an API for use by a third party. Consequently, you will not create an API Client that functions substantially the same as the APIs and offer it for use by third parties.\n </li>\n <li>\n  Perform an action with the intent of introducing to FINESCE services any viruses, worms, defects, Trojan horses, malware, or any items of a destructive nature.\n </li>\n <li>\n  Defame, abuse, harass, stalk, or threaten others.\n </li>\n <li>\n  Interfere with or disrupt the APIs or the servers or networks providing the APIs.\n </li>\n <li>\n  Promote or facilitate unlawful online gambling or disruptive commercial messages or advertisements.\n </li>\n <li>\n  Reverse engineer or attempt to extract the source code from any API or any related software, except to the extent that this restriction is expressly prohibited by applicable law.\n </li>\n <li>\n  Use the APIs for any activities where the use or failure of the APIs could lead to death, personal injury, or environmental damage (such as the operation of nuclear facilities, air traffic control, or life support systems).\n </li>\n <li>\n  Remove, obscure, or alter any FINESCE terms of service or any links to or notices of those terms.\n </li>\n</ul>\n\n\n<h4>\n Confidential Matters\n</h4>\n\n<p>\n Developer credentials (such as passwords, keys, and client IDs) are intended to be used by you and identify your API Client. You will keep your credentials confidential and make reasonable efforts to prevent and discourage other API Clients from using your credentials. Developer credentials may not be embedded in open source projects.\n</p>\n\n<p>\n Our communications to you and our APIs may contain FINESCE confidential information. FINESCE confidential information includes any materials, communications, and information that are marked confidential or that would normally be considered confidential under the circumstances. If you receive any such information, then you will not disclose it to any third party without FINESCE's prior written consent. FINESCE confidential information does not include information that you independently developed, that was rightfully given to you by a third party without confidentiality obligation, or that becomes public through no fault of your own. You may disclose FINESCE confidential information when compelled to do so by law if you provide us reasonable prior notice, unless a court orders that we not receive notice.\n</p>\n\n\n<h3>\n Content\n</h3>\n\n\n<h4>\n Content Accessible Through our APIs\n</h4>\n\n<p>\n Our APIs contain some third party content (such as data, text, images, videos, audio, or software). This content is the sole responsibility of the person that makes it available. We may sometimes review content to determine whether it is illegal or violates our policies or the Terms, and we may remove or refuse to display content. Finally, content accessible through our APIs may be subject to intellectual property rights, and, if so, you may not use it unless you are licensed to do so by the owner of that content or are otherwise permitted by law. Your access to the content provided by the API may be restricted, limited, or filtered in accordance with applicable law, regulation, and policy.\n</p>\n\n\n<h4>\n Submission of Content\n</h4>\n\n<p>\n Some of our APIs allow the submission of content. FINESCE does not acquire any ownership of any intellectual property rights in the content that you submit to our APIs through your API Client, except as expressly provided in the Terms. For the sole purpose of enabling FINESCE to provide, secure, and improve the APIs (and the related service(s)) and only in accordance with the applicable FINESCE privacy policies, you give FINESCE a perpetual, irrevocable, worldwide, sublicensable, royalty-free, and non-exclusive license to Use content submitted, posted, or displayed to or from the APIs through your API Client. \"Use\" means use, host, store, modify, communicate, and publish. Before you submit content to our APIs through your API Client, you will ensure that you have the necessary rights (including the necessary rights from your end users) to grant us the license.\n</p>\n\n\n<h4>\n Retrieval of content\n</h4>\n\n<p>\n When a user's non-public content is obtained through the APIs, you may not expose that content to other users or to third parties without explicit opt-in consent from that user.\n</p>\n\n\n<h4>\n Prohibitions on Content\n</h4>\n\n<p>\n Unless expressly permitted by the content owner or by applicable law, you will not, and will not permit your end users or others acting on your behalf to, do the following with content returned from the APIs:\n</p>\n\n<p>\n Scrape, build databases, or otherwise create permanent copies of such content, or keep cached copies longer than permitted by the cache header;\n</p>\n\n<p>\n Copy, translate, modify, create a derivative work of, sell, lease, lend, convey, distribute, publicly display, or sublicense to any third party;\n</p>\n\n<ul>\n <li>\n  Misrepresent the source or ownership; or\n </li>\n <li>\n  Remove, obscure, or alter any copyright, trademark, or other proprietary rights notices; or falsify or delete any author attributions, legal notices, or other labels of the origin or source of material.\n </li>\n</ul>\n\n\n<h4>\n Publicity\n</h4>\n\n<p>\n You will not make any statement regarding your use of an API which suggests partnership with, sponsorship by, or endorsement by FINESCE without FINESCE's prior written approval.\n</p>\n\n\n<h4>\n Promotional and Marketing Use\n</h4>\n\n<p>\n In the course of promoting, marketing, or demonstrating the APIs you are using and the associated FINESCE products, FINESCE may produce and distribute incidental depictions, including screenshots, video, or other content from your API Client, and may use your company or product name. You grant us all necessary rights for the above purposes.\n</p>\n\n\n<h3>\n Termination\n</h3>\n\n\n<h4>\n Termination\n</h4>\n\n<p>\n You may stop using our APIs at any time with or without notice. Further, if you want to terminate the Terms, you must provide FINESCE with prior written notice and upon termination, cease your use of the applicable APIs. FINESCE reserves the right to terminate the Terms with you or discontinue the APIs or any portion or feature or your access thereto for any reason and at any time without liability or other obligation to you.\n</p>\n\n\n<h4>\n Your Obligations Post-Termination\n</h4>\n\n<p>\n Upon any termination of the Terms or discontinuation of your access to an API, you will immediately stop using the API, cease all use of the FINESCE, and delete any cached or stored content that was permitted by the cache header. FINESCE may independently communicate with any account owner whose account(s) are associated with your API Client and developer credentials to provide notice of the termination of your right to use an API.\n</p>\n\n\n<h3>\n Liability for our APIs\n</h3>\n\n\n<h4>\n WARRANTIES\n</h4>\n\n<p>\n EXCEPT AS EXPRESSLY SET OUT IN THE TERMS, NEITHER FINESCE NOR ITS SUPPLIERS OR DISTRIBUTORS MAKE ANY SPECIFIC PROMISES ABOUT THE APIS. FOR EXAMPLE, WE DON'T MAKE ANY COMMITMENTS ABOUT THE CONTENT ACCESSED THROUGH THE APIS, THE SPECIFIC FUNCTIONS OF THE APIS, OR THEIR RELIABILITY, AVAILABILITY, OR ABILITY TO MEET YOUR NEEDS. WE PROVIDE THE APIS \"AS IS\".\n</p>\n\n<p>\n SOME JURISDICTIONS PROVIDE FOR CERTAIN WARRANTIES, LIKE THE IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. EXCEPT AS EXPRESSLY PROVIDED FOR IN THE TERMS, TO THE EXTENT PERMITTED BY LAW, WE EXCLUDE ALL WARRANTIES, GUARANTEES, CONDITIONS, REPRESENTATIONS, AND UNDERTAKINGS.\n</p>\n\n\n<h4>\n LIMITATION OF LIABILITY\n</h4>\n\n<p>\n WHEN PERMITTED BY LAW, FINESCE, AND FINESCE'S SUPPLIERS AND DISTRIBUTORS, WILL NOT BE RESPONSIBLE FOR LOST PROFITS, REVENUES, OR DATA; FINANCIAL LOSSES; OR INDIRECT, SPECIAL, CONSEQUENTIAL, EXEMPLARY, OR PUNITIVE DAMAGES.\n</p>\n\n<p>\n TO THE EXTENT PERMITTED BY LAW, THE TOTAL LIABILITY OF FINESCE, AND ITS SUPPLIERS AND DISTRIBUTORS, FOR ANY CLAIM UNDER THE TERMS, INCLUDING FOR ANY IMPLIED WARRANTIES, IS LIMITED TO THE AMOUNT YOU PAID EURO TO USE THE APPLICABLE APIS (OR, IF WE CHOOSE, TO SUPPLYING YOU THE APIS AGAIN) DURING THE SIX MONTHS PRIOR TO THE EVENT GIVING RISE TO THE LIABILITY.\n</p>\n\n<p>\n IN ALL CASES, FINESCE, AND ITS SUPPLIERS AND DISTRIBUTORS, WILL NOT BE LIABLE FOR ANY EXPENSE, LOSS, OR DAMAGE THAT IS NOT REASONABLY FORESEEABLE.\n</p>\n\n\n<h4>\n Indemnification\n</h4>\n\n<p>\n Unless prohibited by applicable law, if you are a business, you will defend and indemnify FINESCE, and its affiliates, researchers, and users, against all liabilities, damages, losses, costs, fees (including legal fees), and expenses relating to any allegation or third-party legal proceeding to the extent arising from:\n</p>\n\n<ul>\n <li>\n  your misuse or your end user's misuse of the APIs;\n </li>\n <li>\n  your violation or your end user's violation of the Terms; or\n </li>\n <li>\n  any content or data routed into or used with the APIs by you, those acting on your behalf, or your end users.\n </li>\n</ul>\n\n\n<h3>\n General Provisions\n</h3>\n\n\n<h4>\n Modification\n</h4>\n\n<p>\n We may modify the Terms or any portion to, for example, reflect changes to the law or changes to our APIs. You should look at the Terms regularly. We'll post notice of modifications to the Terms within the documentation of each applicable API, to this website, and/or on the FINESCE website. Changes will not apply retroactively and will become effective no sooner than 30 days after they are posted. But changes addressing new functions for an API or changes made for legal reasons will be effective immediately. If you do not agree to the modified Terms for an API, you should discontinue your use of that API. Your continued use of the API constitutes your acceptance of the modified Terms.\n</p>\n\n\n<h4>\n General Legal Terms\n</h4>\n\n<p>\n We each agree to contract in the English language. If we provide a translation of the Terms, we do so for your convenience only and the English Terms will solely govern our relationship. The Terms do not create any third party beneficiary rights or any agency, partnership, or joint venture. Nothing in the Terms will limit either party's ability to seek injunctive relief. We are not liable for failure or delay in performance to the extent caused by circumstances beyond our reasonable control. If you do not comply with the Terms, and FINESCE does not take action right away, this does not mean that FINESCE is giving up any rights that it may have (such as taking action in the future). If it turns out that a particular term is not enforceable, this will not affect any other terms. The Terms are the entire agreement between you and FINESCE relating to its subject and supersede any prior or contemporaneous agreements on that subject. For information about how to contact FINESCE, please visit our website.\n</p>\n\n\n",
        "wiki_attachments": [
            "/redmine/attachments/download/1368/COS_DSE__Level_Two_Functional_Diagram.png",
            "/redmine/attachments/download/2018/wp5_cos_dse.png",
            "/redmine/attachments/download/2954/COS_SME_ACCESS_Usage_Examples.pdf"
        ],
        "Open Source": "",
        "Contact Person": "\n<p>\n Miguel Ponce de Leon\n <br/>\n TSSG at Waterford Institute of Technology\n <br/>\n <a class=\"email\" href=\"mailto:miguelpdlREMOVE-NO-SPAM@tssg.org\">\n  miguelpdlREMOVE-NO-SPAM@tssg.org\n </a>\n</p>\n\n\n",
        "Overview": "\n<p>\n The WP5 Stream I team have developed an active demand dispatch system as part of the FINESCE API. This system optimises charging profiles for available Electric Vehicles (EV)s on the grid, by taking input of power generation forecasts from system operators‘ web sites and using request-response message exchange patterns with live EVSE's connected to the grid to create an optimised load scheduler every 15 minutes.\n</p>\n\n\n<h3>\n What you get\n</h3>\n\n<p>\n The COS API which is up and available to use, allows a user to view or control an EVSE or access various aggregated trial-site load information e.g. aggregated EV load, renewable energy supply, etc.\n <br/>\n This API would open possibilities of integration of EV control into different end user applications (mobile/web applications) for smart home management, energy management, etc.\n <br/>\n The API relies on HTTP/RESTful services (wherever possible) in order to address the most broad community of application developers with the popular technology\n</p>\n\n\n<h3>\n Why to get it\n</h3>\n\n<p>\n Expose WP5 Stream I EV charging infrastructure and trial results.\n <br/>\n Expose the COS interface allowing the system to be accessible for external applications.\n</p>\n\n<p>\n From a developers point of view the API has an overview on the\n <a class=\"external\" href=\"http://docs.fam.apiary.io/#reference/electric-vehicles\">\n  FINESCE APIary page\n </a>\n and further more detailed documentation in swagger and available at the API website:\n <a class=\"external\" href=\"https://finesce.tssg.org/documentation/index.html\">\n  WP5 FINESCE API for EVs\n </a>\n</p>\n\n\n",
        "Downloads": "\n<p>\n No downloads are available for this result.\n</p>\n\n\n",
        "Instances": "\n<p>\n An instance of the COSs reference implementation runs as a part of the Irish trial and is only accessible via its API.\n</p>\n\n\n"
    }
]