[
    {
        "Target Usage": "",
        "Name": "FINESCE API Mediator (FAM) DSE",
        "Short Description": "",
        "Documentation": {
            "Description": "\n\n<h3>\n Basic Concepts\n</h3>\n\n<p>\n Closely tied to the FINESCE Project outcome as a whole, the FINESCE API is envisioned to constitute, in the future, a de facto standard for data exchange in the framework of web services for smart energy. Since such a communications format standard should not expose heterogeneous sets of APIs, a proper convergence infrastructure should be defined to cope with client API heterogeneity and provide a homogeneous way of accessing web services related to smart energy infrastructures. The scope of FAM is to foster FINESCE API definition through the delivery of a mediation layer that allows for homogenizing access to smart energy infrastructures and exposing their capabilities in a concrete, well-known manner.\n</p>\n\n<p>\n As the intention of the FAM is to be loosely coupled to FINESCE project itself, it should be able to be easily configured to interact with any Smart Energy Web Service (SEWS) data source that exposes (part of) the FINESCE API. Therefore, a simple, proxy solution mapping the FINESCE distinct WP APIs to the FINESCE global one is not acceptable. Instead, a mechanism that facilitates the adoption of the FINESCE API by external, non-FINESCE related infrastructures should be sought. To this end, FAM will be based on the deployment of a Mediator GE instance [1], customized to provide exclusive mediation services to SEWS that expose FINESCE API-related functionality. In this context, the distinct FINESCE WP APIs will act as showcases of the usage of FAM or, else, as simple SEWS.\n</p>\n\n\n<h3>\n Basic Design Principles\n</h3>\n\n<p>\n Constituting a specification of the Mediator GE, the architecture of FAM is depicted in Figure 1.\n</p>\n\n<p style=\"text-align:center;\">\n <img alt=\"\" src=\"images/redmine/FAMArchitecture.png\" style=\"height:400px;\"/>\n <br/>\n Figure 1: FINESCE API Mediator DSE Architecture\n</p>\n\n<p>\n According to the envisioned architecture, two actors are expected to use the FAM DSE, the first one being the SEWS infrastructure operator and the second one being the actual user of the SEWS. A SEWS infrastructure operator willing to use FAM DSE mediation capabilities is expected to provide a mapping of the specification of its own SEWS to the FINESCE API equivalent subset; this will enable the transformation of the FINESCE API requests/responses, to the SEWS respective definitions. Furthermore, an appropriate service endpoint should be defined that will act as a point of message relay between FAM and the SEWS in hand.\n</p>\n\n<p>\n In the absence of FAM DSE, the end user would normally connect directly to the SEWS to get the services she requires. The role of FAM is to hide the heterogeneity of the different SEWS known to it and provide to the end user a single point of entry to desired SEWS; the FINESCE API interface. The Mediator GE, along with the provided specific FINESCE API adaptation, undertakes both the transformation of the FINESCE API compatible requests of the end users to the format defined by the requested SEWS and the routing of the request to the appropriate SEWS endpoint.\n</p>\n\n<p>\n A simplified UML sequence diagram of the mediation process that takes place within FAM is presented in Figure 2.\n</p>\n\n<p style=\"text-align:center;\">\n <img alt=\"\" src=\"images/redmine/APIDSESequence.png\" style=\"height:400px;\"/>\n <br/>\n Figure 2: Simplified API mediation sequence diagram\n</p>\n\n<p>\n FAM is meant to be able to be instantiated and run inside a VM in a FI-WARE compatible infrastructure. Being based on the Mediator GE reference implementation [1], the hardware and software requirements of FAM are expected to be identical to the ones of Mediator GE [2], except for the FINESCE API specification bindings that will be developed to implement an instance of the FINESCE API. Evidently, anyone willing to use FAM should be able to deploy her own FAM instance. However, the architectural description suggests that a single FAM instance should be able to simultaneously provide mediation tasks to numerous SEWS, an approach in general agreement to the overall Mediator GE standpoint [1].\n</p>\n\n\n",
            "Copyright": "\n<p>\n Copyright © 2014 by FINESCE\n</p>\n\n\n",
            "Glossary": "\n<table class=\"themed\">\n <tr class=\"top\">\n  <th>\n   Abbreviation\n  </th>\n  <th>\n   Full Name\n  </th>\n  <th>\n   Description\n  </th>\n </tr>\n <tr>\n  <td style=\"text-align:center;\">\n   DSE\n  </td>\n  <td style=\"text-align:center;\">\n   Domain Specific Enabler\n  </td>\n  <td>\n   A web service that can be re-used like a Generic Enabler, in a Domain Specific manner.\n  </td>\n </tr>\n <tr>\n  <td style=\"text-align:center;\">\n   FAM\n  </td>\n  <td style=\"text-align:center;\">\n   FINESCE API Mediator\n  </td>\n  <td>\n   A simple mediation service that allows for easy exploitation of the FINESCE API specification.\n  </td>\n </tr>\n <tr>\n  <td style=\"text-align:center;\">\n   SEWS\n  </td>\n  <td style=\"text-align:center;\">\n   Smart Energy Web Service\n  </td>\n  <td>\n   An infrastructure that provides web services in the framework of the Smart Energy site. Could be a FINESCE Trial or a third-party web service serving a Smart Grid site.\n  </td>\n </tr>\n</table>\n\n\n",
            "References": "\n<p>\n [1] Mediator GE  - Architecture Description,\n <a class=\"external\" href=\"http://forge.fi-ware.org/plugins/mediawiki/wiki/fiware/index.php/FIWARE.ArchitectureDescription.Apps.Mediator\">\n  FIWARE.ArchitectureDescription.Apps.Mediator\n </a>\n <br/>\n [2] Mediator GE – Installation and administration guide,\n <a class=\"external\" href=\"http://forge.fi-ware.org/plugins/mediawiki/wiki/fiware/index.php/Mediator_-_Installation_and_Administration_Guide\">\n  Mediator_-_Installation_and_Administration_Guide\n </a>\n <br/>\n [3] Apiary website,\n <a class=\"external\" href=\"http://www.apiary.io/\">\n </a>\n <br/>\n [4] The move Database API – Apiary,\n <a class=\"external\" href=\"http://docs.themoviedb.apiary.io/\">\n </a>\n <br/>\n [5] Apache Synapse - The lightweight ESB,\n <a class=\"external\" href=\"https://synapse.apache.org/\">\n </a>\n <br/>\n [6] Apache Camel,\n <a class=\"external\" href=\"https://camel.apache.org/\">\n </a>\n <br/>\n [7]\n <a class=\"external\" href=\"https://130.206.82.22/finesce/api/docs\">\n  docs\n </a>\n <br/>\n [8] FINESCE API - Apiary -\n <a class=\"external\" href=\"http://docs.fam.apiary.io\">\n  docs.fam.apiary.io\n </a>\n <br/>\n [9] Swagger -\n <a class=\"external\" href=\"http://swagger.io/\">\n </a>\n</p>\n\n\n",
            "Details": "\n<p>\n The FINESCE API will be presented in the FINESCE project wiki, as will the rest of the DSEs provided in the framework of the FINESCE project. In order to enable faster development acceptance, the FINESCE API will be published on the API-handling web service called APIARY [3], too. The publication of the FINESCE API on Apiary web service is considered ideal both for quickly exploring the FINESCE API specification and for experimenting with the FAM DSE instance that will be available upon API specification and FAM development completion. What distinguishes Apiary as a complementary option than simply publishing the API to the wiki, is that it inherently provides ways of interacting with an API and inspecting the relevant HTTP traffic flows, as soon as one specifies the API in a concrete manner. Moreover, it provides tools for the automatic generation of code that will use the web services specified by an API, in different programmatic languages, in order to facilitate the consumption of the services advertised through the API in hand (in the case of FINESCE, it is the FINESCE API). Finally, as Apiary can act as a proxy between an API end user and a real web service exposing the API in hand, it can be used as a user experimentation platform, without necessitating the development of the full range of tools normally needed to claim reasonable API exploitation. An indicative (featured) example of API highlighting using APIARY is available at [4], whereas an initial FAM DSE specification example is available at [8].\n</p>\n\n<p>\n Apart from APIARY, the same set of specifications is available at Swagger format  the latter constituting a well known web-service aiming at providing well structured access to RESTful web services [9]. An initial, relative FAM DSE specification example is available at [8].\n</p>\n\n\n<h3>\n Address/Protocol\n</h3>\n\n<p>\n Since FAM exposes the full functionality of FINESCE API, its endpoints are the ones determined through the specification of the later\n <a class=\"wiki-page new\" href=\"/redmine/projects/finesce-domain-specific-enablers/wiki/FINESCE_API_Specification?parent=FINESCE_API_Mediator_%28FAM%29_DSE\">\n  (to be defined)\n </a>\n .\n</p>\n\n\n\nThe following HTTP commands being used to manipulate the data controlled by the COS DSE:\n\t<ul>\n <li>\n  HTTP GET commands used to retrieve information from a SEWS\n </li>\n <li>\n  HTTP PUT commands used to update information maintained by a SEWS\n </li>\n <li>\n  HTTP POST to add new information to a SEWS\n </li>\n <li>\n  HTTP DELETE to remove information from a SEWS\n </li>\n</ul>\n\n<p>\n Current implementation details regarding the supported addresses and methods can be found at [7] and [8].\n</p>\n\n\n<h3>\n Commands\n</h3>\n\n\n<h3>\n Endpoints\n</h3>\n\n<p>\n A complete list of endpoints has not yet been published. An initial set of endpoints can be found at the current DSE documentation services, namely at [7] and [8].\n</p>\n\n\n",
            "Preface": "\n<p>\n This document presents the FINESCE API Mediator (FAM) Domain Specific Enabler (DSE), a service that aims at facilitating the usage of the FINESCE API from third party entities.\n</p>\n\n<p>\n Please consult the appropriate pages on the\n <a class=\"external\" href=\"http://www.finesce.eu/Trial_Site_Terni.html\">\n  FINESCE\n </a>\n website in order to understand the complete context of the related FINESCE trials and this DSE.\n</p>\n\n\n"
        },
        "WP": "",
        "Terms and Conditions": "\n<p>\n Software associated to the FINESCE API Mediator DSE is provided as open source under the Apache v2.0 license. Please check the specific terms and conditions linked to this open source license at\n <a class=\"external\" href=\"http://www.apache.org/licenses/LICENSE-2.0\">\n  LICENSE-2.0\n </a>\n</p>\n\n\n",
        "wiki_attachments": [
            "/redmine/attachments/download/1391/FAMArchitecture.png",
            "/redmine/attachments/download/1392/APIDSESequence.png"
        ],
        "Open Source": "",
        "Contact Person": "",
        "Overview": "\n\n<h3>\n What you get\n</h3>\n\n<p>\n A consolidated approach for interacting with the various FINESCE trial infrastructures, using a simple, RESTful API.\n</p>\n\n\n<h3>\n Why to get it\n</h3>\n\n<p>\n It enables seamless, interoperable interaction with all the FINESCE trial infrastructures, in a transparent, homogeneous manner.\n</p>\n\n\n<h3>\n Open Specifications\n</h3>\n\n<p>\n A complete list of functionalities is going to be released in the coming months. As FAM DSE will be released as OSS, open specifications will be also available.\n</p>\n\n\n",
        "Downloads": "\n<p>\n A download link for this DSE is not yet available.\n</p>\n\n\n",
        "Instances": ""
    }
]