[
    {
        "Target Usage": "",
        "Name": "Hybrid Cloud Data Management (HCDM) DSE",
        "Short Description": "",
        "Documentation": {
            "Description": "\n\n<h3>\n Basic Concepts\n</h3>\n\n<p>\n Hybrid Cloud Data Management DSE is built by the combination and integration of Object Storage GE and Identity Management Keyrock GE instances in FIWARE Lab, the local deployment of Object Storage capacities and additional encryption functionalities.\n</p>\n\n<p>\n It was initially designed to provide transparent access to the Hybrid Cloud infrastructure for the data management of the utilities within the \"Software Define Utility\" concept.  It offers with a single dashboard tool the storage management of data in two sides. Distributed machines are used to store private and very sensitive data, while the rest of the data is stored in FILAB Cloud. The identity management of all the users in order to access this data is undertaken using Identity Management Keyrock GE in FIWARE Lab.\n</p>\n\n\n<h3>\n Basic Design Principles\n</h3>\n\n\n",
            "Copyright": "\n<p>\n Copyright © 2015 by FINESCE\n</p>\n\n\n",
            "Glossary": "\n<table class=\"themed\">\n <tr class=\"top\">\n  <td style=\"background:lightgrey;\">\n   Term\n  </td>\n  <td style=\"background:lightgrey;\">\n   Definition\n  </td>\n </tr>\n <tr>\n  <td>\n   API\n  </td>\n  <td>\n   Application Programming Interface\n  </td>\n </tr>\n <tr>\n  <td>\n   HCDM\n  </td>\n  <td>\n   Hybrid Cloud Data Management\n  </td>\n </tr>\n <tr>\n  <td>\n   DSE\n  </td>\n  <td>\n   Domain Specific Enabler\n  </td>\n </tr>\n <tr>\n  <td>\n   GE\n  </td>\n  <td>\n   Generic Enabler\n  </td>\n </tr>\n <tr>\n  <td>\n   DSO\n  </td>\n  <td>\n   Distribution System Operator\n  </td>\n </tr>\n <tr>\n  <td>\n   EV\n  </td>\n  <td>\n   Electric Vehicle\n  </td>\n </tr>\n <tr>\n  <td>\n   EVSE\n  </td>\n  <td>\n   Electric Vehicle Supply Equipment\n  </td>\n </tr>\n</table>\n\n\n",
            "References": "\n\n",
            "Details": "\n<p>\n The HCDM API which is up and available to use, allows a user to access and manage data objects in the private cloud provided in the trial-site of Ireland, which is used to store historic EVSE data, or in the public cloud deployed in the FIWARE Lab.\n <br/>\n This API would open possibilities of share DSO data with other stakeholders in an easy and secure way.\n</p>\n\n<p>\n The API follows the rules of a common RESTful approach:\n</p>\n\n<ol>\n <li>\n  Rely on HTTP/RESTful services (wherever possible) in order to address the most broad community of application developers with the popular technology\n </li>\n <li>\n  Expose WP5 Stream II Future Internet in Smart Distribution Grid Communications infrastructure and trial results\n </li>\n <li>\n  Expose the HCDM DSE interface allowing the system to be accessible for external applications.\n </li>\n</ol>\n\n\n<h3>\n API Control functions\n</h3>\n\n<p>\n The base url for all requests is\n <strong>\n  xxxx\n </strong>\n , and any requests using http will be redirected to https, of note a self-signed cert is used for SSL.\n</p>\n\n\n\nThe following HTTP commands have been implemented being used to manipulate the data controlled by the FINESCE system.\n\t<ol>\n <li>\n  HTTP GET commands used to retrieve information or objects from the cloud platforms\n </li>\n <li>\n  HTTP PUT commands used to create new containers in the cloud platforms or upload a new object\n </li>\n</ol>\n\n<p>\n -The following endpoints are currently implemented in the external API system on collection resources. All calls require an auth_token to be sent with the request (This excludes the tokens endpoint). NOTE: the parameter for sending the authorisation token is \"auth_token\".\n</p>\n\n<ol>\n <li>\n  Miscellaneous\n </li>\n <li>\n  Generationplants\n </li>\n <li>\n  Regionalaggevseenergies\n </li>\n <li>\n  Timeslots\n </li>\n <li>\n  Evevseconnections\n </li>\n <li>\n  Chargingmodes\n </li>\n <li>\n  Electricvehicles\n </li>\n <li>\n  Estimatedsocs\n </li>\n <li>\n  Regions\n </li>\n <li>\n  Generationtypes\n </li>\n <li>\n  Regionalenergies\n </li>\n <li>\n  Evses\n </li>\n <li>\n  Evevseconnectionstates\n </li>\n <li>\n  Evtypes\n </li>\n <li>\n  Stateofcharges-\n </li>\n</ol>\n\n\n",
            "Preface": "\n<p>\n Within this document you find a self-contained open specification of the FINESCE WP5 Charging Optimisation System (COS) Domain Specific Enabler (DSE).\n</p>\n\n<p>\n Please consult the appropriate pages on the\n <a class=\"external\" href=\"http://www.finesce.eu/Trial_Site_Ireland.html\">\n  FINESCE\n </a>\n website in order to understand the complete context of the related FINESCE trials and this DSE.\n</p>\n\n\n",
            "ReutilisedTech": "\n<p>\n As mentioned earlier the HCDM DSE re-uses the FI-WARE Object Storage GE and Identity Management Keyrock GE.\n</p>\n\n\n"
        },
        "WP": "",
        "Terms and Conditions": "\n<p>\n An instance of this SE’s reference implementation runs as a part of the Irish trial and is only accessible via its API. Documentation on the API can be found at\n <a class=\"external\" href=\"https://finesce.tssg.org/documentation/index.html\">\n  https://finesce.tssg.org/documentation/index.html\n </a>\n</p>\n\n\n",
        "wiki_attachments": [],
        "Open Source": "",
        "Contact Person": "\n<p>\n Ramon Martin de Pozuelo\n <br/>\n FUNITEC - La Salle\n <br/>\n <a class=\"email\" href=\"mailto:ramonmdpREMOVE-NO-SPAM@salleurl.edu\">\n  ramonmdpREMOVE-NO-SPAM@salleurl.edu\n </a>\n</p>\n\n<p>\n Alan Briones\n <br/>\n FUNITEC - La Salle\n <br/>\n <a class=\"email\" href=\"mailto:abrionesREMOVE-NO-SPAM@salleurl.edu\">\n  abrionesREMOVE-NO-SPAM@salleurl.edu\n </a>\n</p>\n\n<p>\n Agustín Zaballos\n <br/>\n FUNITEC - La Salle\n <br/>\n <a class=\"email\" href=\"mailto:zaballosREMOVE-NO-SPAM@salleurl.edu\">\n  zaballosREMOVE-NO-SPAM@salleurl.edu\n </a>\n</p>\n\n",
        "Overview": "\n\n<h3>\n What you get\n</h3>\n\n<p>\n Hybrid Cloud Data Management is a REST service which provides to users transparent access to the Hybrid Cloud (distributed local storage or cloud storage system) infrastructure for the data management of the \"Software Define Utility”, combining and integrating functionalities from Object Storage GE local instances and in FIWARE Lab; authentication through Identity Management Keyrock GE; and additional encryption functionalities.\n</p>\n\n\n<h3>\n Why to get it\n</h3>\n\n<p>\n A reference implementation of a REST service which is allows a secure management of data, privately (although allowing replication among different regions), and publicly (storing objects in FIWARE Lab through Object Storage GE).\n</p>\n\n\n<h3>\n Target Usage\n</h3>\n\n<p>\n This DSE is thought to be a data management tool for utilities (to upload public information on Electric Vehicle charging points, Smart Metering, costs of transmission system and power plants, energy costs, etc.).\n <br/>\n It could be useful for any retailer that wants a straight-forward but secure tool to manage data and share it with other stakeholders.\n</p>\n\n\n",
        "Downloads": "\n<p>\n <strong>\n  xxxx\n </strong>\n</p>\n\n\n",
        "Instances": ""
    }
]