[
    {
        "Target Usage": "",
        "Name": "Modbus Connector (ModConn) DSE",
        "Short Description": "",
        "Documentation": {
            "Description": "\n<p>\n Gathering of the energy consumption data of the machine tools is done by power measuring devices such as a Siemens Sentron PAC 3200. The collected data is first stored locally on a record carrier to provide it for other systems. For encapsulating the energy measurement system websockets were chosen on a technical layer. The use of web based standards such as RFC6455 for websockets holds the advantage of significant lower roundtrip latency times and enables bidirectional communication compared to SOAP or REST. Furthermore, the communication can be performed event based, which is especially useful in an production environment. The same interface can be used for event based status monitoring by a Manufacturing Execution System (MES) as well as long-term monitoring applications. Furthermore, communication over websocket allows for a play &amp; play interface for integrating any higher level systems.\n</p>\n\n\n",
            "Copyright": "\n<p>\n Copyright © 2014 by FINESCE\n</p>\n\n\n",
            "Glossary": "\n<ul>\n <li>\n  MES: Manufacturing Execution System\n </li>\n <li>\n  REST: Representational State Transfer\n </li>\n <li>\n  SOAP: Simple Object Access Protocol\n </li>\n</ul>\n\n\n",
            "References": "\n<ul>\n <li>\n  RFC6455:\n  <a class=\"external\" href=\"https://tools.ietf.org/html/rfc6455\">\n   https://tools.ietf.org/html/rfc6455\n  </a>\n </li>\n</ul>\n\n\n",
            "Details": "",
            "Preface": "\n<p>\n Within this document you find a self-contained open specification of the aforementioned Domain Specific Enabler (DSE).\n</p>\n\n<p>\n Please consult the appropriate pages on the\n <a class=\"external\" href=\"http://www.finesce.eu/Trial_Site_Ireland.html\">\n  FINESCE\n </a>\n website in order to understand the complete context of the related FINESCE trials and this DSE.\n</p>\n\n\n",
            "ReutilisedTech": "\n<p>\n Communicates with GE EspR4FastData.\n</p>\n\n\n"
        },
        "WP": "",
        "Terms and Conditions": "\n<p>\n An instance of this DSE’s reference implementation runs as a part of the trial and is not publicly accessible.\n</p>\n\n\n",
        "wiki_attachments": [
            "/redmine/attachments/download/1414/WP3-Factory_ModConn-DSE_Overview.png"
        ],
        "Open Source": "",
        "Contact Person": "\n<p>\n Julian Krenge\n <br/>\n FIR at RWTH Aachen University\n <br/>\n <a class=\"email\" href=\"mailto:Julian.KrengeREMOVE-NO-SPAM@fir.rwth-aachen.de\">\n  Julian.KrengeREMOVE-NO-SPAM@fir.rwth-aachen.de\n </a>\n</p>\n\n",
        "Overview": "\n<p>\n Main purpose of the ModConn DSE is the integration of shopfloor infrastructure with the GE Gateway Data Handling. It was first investigated, whether the GE Protocol Adapter might be sufficient to perform this task, but as it is not tailored to Modbus, the solution of an individual DSE was chosen. The DSE Modbus connector consists of two components, in order to allow for the segregation of the shopfloor Ethernet and the enterprise Ethernet. There is one component for each side of this gap.\n</p>\n\n<p>\n <img alt=\"\" src=\"images/redmine/WP3-Factory_ModConn-DSE_Overview.png\" style=\"width: 592px;\"/>\n</p>\n\n<p>\n As shown in the image above, the websocket-server component is located within the shop floor network and communicates with the websocket-client component.\n</p>\n\n\n",
        "Downloads": "\n<p>\n None.\n</p>\n\n\n",
        "Instances": "\n<p>\n An instance of this DSE’s reference implementation runs as a part of the trial and is not publicly accessible.\n</p>\n\n\n"
    }
]